app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN (?, ?, ?, ?) ORDER BY release_date asc  [["rating", "G"], ["rating", "PG"], ["rating", "PG-13"], ["rating", "R"]]
---
  def index
    @all_ratings = Movie.ratings
    @sort = params[:sort]||session[:sort]
    session[:ratings] = session[:ratings]||{'G'=>'','PG'=>'','PG-13'=>'','R'=>''}
    @t_param = params[:ratings] || session[:ratings]
    session[:sort] = @sort
    session[:ratings] = @t_param
    @movies = Movie.where(rating: session[:ratings].keys).order(session[:sort])